Tekla Open API Reference for Tekla Structures 2025
AngleList.ToString Method (IEnumerable<Angle>)
 Converts the given angles to a string in the current units
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string ToString(
	IEnumerable<Angle> angleList
)
Public Shared Function ToString (
	angleList As IEnumerable(Of Angle)
) As String
Parameters
angleList
Type: System.Collections.Generic.IEnumerable<Angle>
List of angles to convert
Return Value
Type: String
The angle list as a string
See Also
Reference
AngleList Class
ToString Overload
Tekla.Structures.Datatype Namespace